## Part 9 - Cleaning Data

Importando Numpy y Pandas

In [3]:
import pandas as pd
import numpy as np

In [13]:
diccionario = {"nombres": ["Manuel", "Tomás", "Sebastián", "Chris", np.nan, None, "NA"],
              "apellido": ["Klug", "Smith", "Parker", "Schafer", None, np.nan, "Missing"],
              "edad": [23, 23, 22, 36, np.nan, np.nan, "Missing"],
              "mails": ["mk@g.com", "tm@g.com", "st@g.com", None, np.nan, "email@g.com", "NA"]}

df = pd.DataFrame(diccionario)

In [14]:
df

     nombres apellido     edad        mails
0     Manuel     Klug       23     mk@g.com
1      Tomás    Smith       23     tm@g.com
2  Sebastián   Parker       22     st@g.com
3      Chris  Schafer       36         None
4        NaN     None      NaN          NaN
5       None      NaN      NaN  email@g.com
6         NA  Missing  Missing           NA

### Eliminar valores nulos:

In [15]:
df.dropna()

     nombres apellido     edad     mails
0     Manuel     Klug       23  mk@g.com
1      Tomás    Smith       23  tm@g.com
2  Sebastián   Parker       22  st@g.com
6         NA  Missing  Missing        NA

In [16]:
# Otra forma:
df.dropna(axis="index", how="any")

     nombres apellido     edad     mails
0     Manuel     Klug       23  mk@g.com
1      Tomás    Smith       23  tm@g.com
2  Sebastián   Parker       22  st@g.com
6         NA  Missing  Missing        NA

In [18]:
# Si hacemos que how="all", entonces eliminará una fila si TODOS los valores de la fila son nulos
df.dropna(axis="index", how="all")

     nombres apellido     edad        mails
0     Manuel     Klug       23     mk@g.com
1      Tomás    Smith       23     tm@g.com
2  Sebastián   Parker       22     st@g.com
3      Chris  Schafer       36         None
5       None      NaN      NaN  email@g.com
6         NA  Missing  Missing           NA